Autodesk.Revit.DB.TypeBinding.#ctor(Autodesk.Revit.DB.CategorySet)
Constructs a type binding with the set of categories passed.
Remarks: Categories can be set or changed at a later time by using the Categories property of this object.

Autodesk.Revit.DB.TypeBinding.#ctor
Constructs an empty type binding.
Remarks: Categories can be set a later time by using the Categories property of this object.

Autodesk.Revit.DB.TypeBinding
TypeBinding objects are used to bind a property to a Revit type, such as a wall type.
Remarks: This differs from Instance bindings in that the property is then shared by all
instances that use that type. Changing the parameter for one type affects all other
instances that use that type.